[Killed] ArrayDeclaration
server/validation/DeckValidator.ts:25:28
   cardIds: string[],
   ownedCards: Map<string, number> | null = null
 ): DeckValidationResult {
-  const errors: string[] = [];
+  const errors: string[] = ["Stryker was here"];
 
   if (!Array.isArray(cardIds)) {
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:27:7
 ): DeckValidationResult {
   const errors: string[] = [];
 
-  if (!Array.isArray(cardIds)) {
+  if (true) {
     return { valid: false, errors: ['cardIds must be an array.'] };
   }
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
server/validation/DeckValidator.ts:27:7
 ): DeckValidationResult {
   const errors: string[] = [];
 
-  if (!Array.isArray(cardIds)) {
+  if (Array.isArray(cardIds)) {
     return { valid: false, errors: ['cardIds must be an array.'] };
   }
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
server/validation/DeckValidator.ts:28:21
   const errors: string[] = [];
 
   if (!Array.isArray(cardIds)) {
-    return { valid: false, errors: ['cardIds must be an array.'] };
+    return { valid: true, errors: ['cardIds must be an array.'] };
   }
 
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
server/validation/DeckValidator.ts:28:36
   const errors: string[] = [];
 
   if (!Array.isArray(cardIds)) {
-    return { valid: false, errors: ['cardIds must be an array.'] };
+    return { valid: false, errors: [] };
   }
 
killedBy: DeckValidator rejects non-array input
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
server/validation/DeckValidator.ts:31:37
     return { valid: false, errors: ['cardIds must be an array.'] };
   }
 
-  if (cardIds.length !== DECK_SIZE) {
-    errors.push(`Deck must have exactly ${DECK_SIZE} cards, got ${cardIds.length}.`);
-  }
+  if (cardIds.length !== DECK_SIZE) {}
 
   if (cardIds.includes('king')) {
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
server/validation/DeckValidator.ts:31:7
     return { valid: false, errors: ['cardIds must be an array.'] };
   }
 
-  if (cardIds.length !== DECK_SIZE) {
+  if (cardIds.length === DECK_SIZE) {
     errors.push(`Deck must have exactly ${DECK_SIZE} cards, got ${cardIds.length}.`);
   }
killedBy: DeckValidator accepts a valid 31-card deck
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:35:7
     errors.push(`Deck must have exactly ${DECK_SIZE} cards, got ${cardIds.length}.`);
   }
 
-  if (cardIds.includes('king')) {
+  if (false) {
     errors.push('King cannot be in deck (pre-placed automatically).');
   }
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:35:7
     errors.push(`Deck must have exactly ${DECK_SIZE} cards, got ${cardIds.length}.`);
   }
 
-  if (cardIds.includes('king')) {
+  if (true) {
     errors.push('King cannot be in deck (pre-placed automatically).');
   }
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
server/validation/DeckValidator.ts:36:17
   }
 
   if (cardIds.includes('king')) {
-    errors.push('King cannot be in deck (pre-placed automatically).');
+    errors.push("");
   }
 
killedBy: DeckValidator rejects deck containing king
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
server/validation/DeckValidator.ts:39:19
     errors.push('King cannot be in deck (pre-placed automatically).');
   }
 
-  const unknown = cardIds.filter(id => !getCardFromPool(id));
+  const unknown = cardIds;
   if (unknown.length > 0) {
     errors.push(`Unknown card IDs: ${[...new Set(unknown)].join(', ')}`);
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
server/validation/DeckValidator.ts:39:34
     errors.push('King cannot be in deck (pre-placed automatically).');
   }
 
-  const unknown = cardIds.filter(id => !getCardFromPool(id));
+  const unknown = cardIds.filter(() => undefined);
   if (unknown.length > 0) {
     errors.push(`Unknown card IDs: ${[...new Set(unknown)].join(', ')}`);
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:40:7
   }
 
   const unknown = cardIds.filter(id => !getCardFromPool(id));
-  if (unknown.length > 0) {
+  if (true) {
     errors.push(`Unknown card IDs: ${[...new Set(unknown)].join(', ')}`);
   }
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:40:7
   }
 
   const unknown = cardIds.filter(id => !getCardFromPool(id));
-  if (unknown.length > 0) {
+  if (false) {
     errors.push(`Unknown card IDs: ${[...new Set(unknown)].join(', ')}`);
   }
killedBy: DeckValidator rejects unknown card IDs
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
server/validation/DeckValidator.ts:45:29
   }
 
   const counts = new Map<string, number>();
-  for (const id of cardIds) {
-    counts.set(id, (counts.get(id) ?? 0) + 1);
-  }
+  for (const id of cardIds) {}
 
   for (const [id, count] of counts) {
killedBy: DeckValidator rejects too many copies of a card
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
server/validation/DeckValidator.ts:46:20
 
   const counts = new Map<string, number>();
   for (const id of cardIds) {
-    counts.set(id, (counts.get(id) ?? 0) + 1);
+    counts.set(id, (counts.get(id) ?? 0) - 1);
   }
 
killedBy: Deck CRUD (DB integration) ownership validation rejects cards not owned
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
server/validation/DeckValidator.ts:46:21
 
   const counts = new Map<string, number>();
   for (const id of cardIds) {
-    counts.set(id, (counts.get(id) ?? 0) + 1);
+    counts.set(id, (counts.get(id) && 0) + 1);
   }
 
killedBy: DeckValidator rejects too many copies of a card
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
server/validation/DeckValidator.ts:49:37
     counts.set(id, (counts.get(id) ?? 0) + 1);
   }
 
-  for (const [id, count] of counts) {
-    const card = getCardFromPool(id);
-    if (card && count > card.copies) {
-      errors.push(`${card.name}: ${count} copies, max ${card.copies}.`);
-    }
-  }
+  for (const [id, count] of counts) {}
 
   if (ownedCards) {
killedBy: DeckValidator rejects too many copies of a card
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:51:9
 
   for (const [id, count] of counts) {
     const card = getCardFromPool(id);
-    if (card && count > card.copies) {
+    if (true) {
       errors.push(`${card.name}: ${count} copies, max ${card.copies}.`);
     }
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:51:17
 
   for (const [id, count] of counts) {
     const card = getCardFromPool(id);
-    if (card && count > card.copies) {
+    if (card && true) {
       errors.push(`${card.name}: ${count} copies, max ${card.copies}.`);
     }
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
server/validation/DeckValidator.ts:52:19
   for (const [id, count] of counts) {
     const card = getCardFromPool(id);
     if (card && count > card.copies) {
-      errors.push(`${card.name}: ${count} copies, max ${card.copies}.`);
+      errors.push(``);
     }
   }
killedBy: DeckValidator rejects too many copies of a card
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:56:7
     }
   }
 
-  if (ownedCards) {
+  if (false) {
     for (const [id, count] of counts) {
       const owned = ownedCards.get(id) ?? 0;
killedBy: DeckValidator validates ownership when ownedCards is provided
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:56:7
     }
   }
 
-  if (ownedCards) {
+  if (true) {
     for (const [id, count] of counts) {
       const owned = ownedCards.get(id) ?? 0;
statusReason: Cannot read properties of null (reading 'get')

[Killed] BlockStatement
server/validation/DeckValidator.ts:57:39
   }
 
   if (ownedCards) {
-    for (const [id, count] of counts) {
-      const owned = ownedCards.get(id) ?? 0;
-      if (count > owned) {
-        const card = getCardFromPool(id);
-        errors.push(`${card?.name ?? id}: need ${count}, own ${owned}.`);
-      }
-    }
+    for (const [id, count] of counts) {}
   }
 
killedBy: DeckValidator validates ownership when ownedCards is provided
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
server/validation/DeckValidator.ts:58:21
 
   if (ownedCards) {
     for (const [id, count] of counts) {
-      const owned = ownedCards.get(id) ?? 0;
+      const owned = ownedCards.get(id) && 0;
       if (count > owned) {
         const card = getCardFromPool(id);
killedBy: DeckValidator validates ownership when ownedCards is provided
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
server/validation/DeckValidator.ts:59:11
   if (ownedCards) {
     for (const [id, count] of counts) {
       const owned = ownedCards.get(id) ?? 0;
-      if (count > owned) {
+      if (count <= owned) {
         const card = getCardFromPool(id);
         errors.push(`${card?.name ?? id}: need ${count}, own ${owned}.`);
killedBy: Deck CRUD (DB integration) ownership validation rejects cards not owned
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/validation/DeckValidator.ts:59:11
   if (ownedCards) {
     for (const [id, count] of counts) {
       const owned = ownedCards.get(id) ?? 0;
-      if (count > owned) {
+      if (false) {
         const card = getCardFromPool(id);
         errors.push(`${card?.name ?? id}: need ${count}, own ${owned}.`);
killedBy: DeckValidator validates ownership when ownedCards is provided
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
server/validation/DeckValidator.ts:61:24
       const owned = ownedCards.get(id) ?? 0;
       if (count > owned) {
         const card = getCardFromPool(id);
-        errors.push(`${card?.name ?? id}: need ${count}, own ${owned}.`);
+        errors.push(`${card?.name && id}: need ${count}, own ${owned}.`);
       }
     }
killedBy: DeckValidator validates ownership when ownedCards is provided
statusReason: expected false to be true // Object.is equality

[Survived] OptionalChaining
server/validation/DeckValidator.ts:61:24
       const owned = ownedCards.get(id) ?? 0;
       if (count > owned) {
         const card = getCardFromPool(id);
-        errors.push(`${card?.name ?? id}: need ${count}, own ${owned}.`);
+        errors.push(`${card.name ?? id}: need ${count}, own ${owned}.`);
       }
     }
