[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:37:7
   const events: GameEvent[] = [];
 
   // ── TARGET resolution ─────────────────────────────────────
-  if (command.kind === 'TARGET' && selection.kind === 'TARGET') {
+  if (true) {
     resolveTarget(command, selection.instanceId, ctx, events);
   }

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:37:7
   const events: GameEvent[] = [];
 
   // ── TARGET resolution ─────────────────────────────────────
-  if (command.kind === 'TARGET' && selection.kind === 'TARGET') {
+  if (true && selection.kind === 'TARGET') {
     resolveTarget(command, selection.instanceId, ctx, events);
   }

[Killed] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:42:7
   }
 
   // ── POSITION summon — place a unit at the selected position
-  if (command.kind === 'POSITION' && selection.kind === 'POSITION') {
+  if (true) {
     events.push({
       type: 'UNIT_PLACED',
killedBy: Game Loop — full match to completion plays a full game to GAME_OVER
statusReason: [Board] Out of bounds: (undefined,undefined)

[Survived] EqualityOperator
src/game/pending/PendingCommandResolver.ts:42:7
   }
 
   // ── POSITION summon — place a unit at the selected position
-  if (command.kind === 'POSITION' && selection.kind === 'POSITION') {
+  if (command.kind !== 'POSITION' && selection.kind === 'POSITION') {
     events.push({
       type: 'UNIT_PLACED',

[Killed] EqualityOperator
src/game/pending/PendingCommandResolver.ts:55:36
   }
 
   // ── COLUMN resolution ────────────────────────────────────
-  if (command.kind === 'COLUMN' && selection.kind === 'COLUMN') {
+  if (command.kind === 'COLUMN' && selection.kind !== 'COLUMN') {
     if (command.sourceAbility === AbilityType.SPELL_EARTHQUAKE && ctx?.board) {
       events.push(...applyEarthquakeDamage(selection.col, 3, ctx.board as any));
killedBy: COLUMN pending resolution (Earthquake) selectColumn damages units in the selected column
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/game/pending/PendingCommandResolver.ts:55:7
   }
 
   // ── COLUMN resolution ────────────────────────────────────
-  if (command.kind === 'COLUMN' && selection.kind === 'COLUMN') {
+  if (command.kind !== 'COLUMN' && selection.kind === 'COLUMN') {
     if (command.sourceAbility === AbilityType.SPELL_EARTHQUAKE && ctx?.board) {
       events.push(...applyEarthquakeDamage(selection.col, 3, ctx.board as any));
killedBy: COLUMN pending resolution (Earthquake) selectColumn damages units in the selected column
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/game/pending/PendingCommandResolver.ts:56:9
 
   // ── COLUMN resolution ────────────────────────────────────
   if (command.kind === 'COLUMN' && selection.kind === 'COLUMN') {
-    if (command.sourceAbility === AbilityType.SPELL_EARTHQUAKE && ctx?.board) {
+    if (command.sourceAbility !== AbilityType.SPELL_EARTHQUAKE && ctx?.board) {
       events.push(...applyEarthquakeDamage(selection.col, 3, ctx.board as any));
     }
killedBy: COLUMN pending resolution (Earthquake) selectColumn damages units in the selected column
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/game/pending/PendingCommandResolver.ts:56:79
 
   // ── COLUMN resolution ────────────────────────────────────
   if (command.kind === 'COLUMN' && selection.kind === 'COLUMN') {
-    if (command.sourceAbility === AbilityType.SPELL_EARTHQUAKE && ctx?.board) {
-      events.push(...applyEarthquakeDamage(selection.col, 3, ctx.board as any));
-    }
+    if (command.sourceAbility === AbilityType.SPELL_EARTHQUAKE && ctx?.board) {}
   }
 
killedBy: COLUMN pending resolution (Earthquake) selectColumn damages units in the selected column
statusReason: expected 0 to be greater than or equal to 1

[Survived] EqualityOperator
src/game/pending/PendingCommandResolver.ts:62:37
   }
 
   // ── DISCARD resolution ──────────────────────────────────
-  if (command.kind === 'DISCARD' && selection.kind === 'DISCARD') {
+  if (command.kind === 'DISCARD' && selection.kind !== 'DISCARD') {
     // The actual discard is handled by GameEngine.selectDiscard()
     // which calls PlayerState.discardFromHand() after resolution.

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:62:37
   }
 
   // ── DISCARD resolution ──────────────────────────────────
-  if (command.kind === 'DISCARD' && selection.kind === 'DISCARD') {
+  if (command.kind === 'DISCARD' && true) {
     // The actual discard is handled by GameEngine.selectDiscard()
     // which calls PlayerState.discardFromHand() after resolution.

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:86:7
   const ability = cmd.sourceAbility;
 
   // ── Priest: full heal ──────────────────────────────────────
-  if (ability === AbilityType.ON_DEPLOY_HEAL_FRIENDLY) {
+  if (false) {
     if (!ctx?.board) return;
     const unit = ctx.board.getUnitById(targetId);

[Survived] EqualityOperator
src/game/pending/PendingCommandResolver.ts:86:7
   const ability = cmd.sourceAbility;
 
   // ── Priest: full heal ──────────────────────────────────────
-  if (ability === AbilityType.ON_DEPLOY_HEAL_FRIENDLY) {
+  if (ability !== AbilityType.ON_DEPLOY_HEAL_FRIENDLY) {
     if (!ctx?.board) return;
     const unit = ctx.board.getUnitById(targetId);

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:87:9
 
   // ── Priest: full heal ──────────────────────────────────────
   if (ability === AbilityType.ON_DEPLOY_HEAL_FRIENDLY) {
-    if (!ctx?.board) return;
+    if (true) return;
     const unit = ctx.board.getUnitById(targetId);
     if (!unit) return;

[Survived] OptionalChaining
src/game/pending/PendingCommandResolver.ts:87:10
 
   // ── Priest: full heal ──────────────────────────────────────
   if (ability === AbilityType.ON_DEPLOY_HEAL_FRIENDLY) {
-    if (!ctx?.board) return;
+    if (!ctx.board) return;
     const unit = ctx.board.getUnitById(targetId);
     if (!unit) return;

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:89:9
   if (ability === AbilityType.ON_DEPLOY_HEAL_FRIENDLY) {
     if (!ctx?.board) return;
     const unit = ctx.board.getUnitById(targetId);
-    if (!unit) return;
+    if (true) return;
     const healAmount = unit.maxDef - unit.currentDef;
     if (healAmount <= 0) return; // already full HP

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:89:9
   if (ability === AbilityType.ON_DEPLOY_HEAL_FRIENDLY) {
     if (!ctx?.board) return;
     const unit = ctx.board.getUnitById(targetId);
-    if (!unit) return;
+    if (false) return;
     const healAmount = unit.maxDef - unit.currentDef;
     if (healAmount <= 0) return; // already full HP

[Survived] ArithmeticOperator
src/game/pending/PendingCommandResolver.ts:90:24
     if (!ctx?.board) return;
     const unit = ctx.board.getUnitById(targetId);
     if (!unit) return;
-    const healAmount = unit.maxDef - unit.currentDef;
+    const healAmount = unit.maxDef + unit.currentDef;
     if (healAmount <= 0) return; // already full HP
     events.push({

[Survived] EqualityOperator
src/game/pending/PendingCommandResolver.ts:91:9
     const unit = ctx.board.getUnitById(targetId);
     if (!unit) return;
     const healAmount = unit.maxDef - unit.currentDef;
-    if (healAmount <= 0) return; // already full HP
+    if (healAmount < 0) return; // already full HP
     events.push({
       type: 'UNIT_HEALED',

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:91:9
     const unit = ctx.board.getUnitById(targetId);
     if (!unit) return;
     const healAmount = unit.maxDef - unit.currentDef;
-    if (healAmount <= 0) return; // already full HP
+    if (true) return; // already full HP
     events.push({
       type: 'UNIT_HEALED',

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:108:7
   }
 
   // ── Disease: damage structure + adjacent ────────────────────
-  if (ability === AbilityType.SPELL_DAMAGE_STRUCTURE_ADJ) {
+  if (true) {
     if (!ctx?.board) return;
     const structure = ctx.board.getUnitById(targetId);

[Survived] EqualityOperator
src/game/pending/PendingCommandResolver.ts:108:7
   }
 
   // ── Disease: damage structure + adjacent ────────────────────
-  if (ability === AbilityType.SPELL_DAMAGE_STRUCTURE_ADJ) {
+  if (ability !== AbilityType.SPELL_DAMAGE_STRUCTURE_ADJ) {
     if (!ctx?.board) return;
     const structure = ctx.board.getUnitById(targetId);

[Survived] OptionalChaining
src/game/pending/PendingCommandResolver.ts:109:10
 
   // ── Disease: damage structure + adjacent ────────────────────
   if (ability === AbilityType.SPELL_DAMAGE_STRUCTURE_ADJ) {
-    if (!ctx?.board) return;
+    if (!ctx.board) return;
     const structure = ctx.board.getUnitById(targetId);
     if (!structure) return;

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:109:9
 
   // ── Disease: damage structure + adjacent ────────────────────
   if (ability === AbilityType.SPELL_DAMAGE_STRUCTURE_ADJ) {
-    if (!ctx?.board) return;
+    if (false) return;
     const structure = ctx.board.getUnitById(targetId);
     if (!structure) return;

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:111:9
   if (ability === AbilityType.SPELL_DAMAGE_STRUCTURE_ADJ) {
     if (!ctx?.board) return;
     const structure = ctx.board.getUnitById(targetId);
-    if (!structure) return;
+    if (true) return;
     // Apply Disease timed effect — the actual damage ticks happen in EndPhase
     // For now, emit a structure-targeted event the engine can track

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:111:9
   if (ability === AbilityType.SPELL_DAMAGE_STRUCTURE_ADJ) {
     if (!ctx?.board) return;
     const structure = ctx.board.getUnitById(targetId);
-    if (!structure) return;
+    if (false) return;
     // Apply Disease timed effect — the actual damage ticks happen in EndPhase
     // For now, emit a structure-targeted event the engine can track

[Survived] EqualityOperator
src/game/pending/PendingCommandResolver.ts:129:9
       maxHP: structure.maxDef,
     } as GameEvent);
     // If structure dies from this
-    if (structure.currentDef - 1 <= 0) {
+    if (structure.currentDef - 1 < 0) {
       events.push({
         type: 'UNIT_DIED',

[Survived] ArithmeticOperator
src/game/pending/PendingCommandResolver.ts:129:9
       maxHP: structure.maxDef,
     } as GameEvent);
     // If structure dies from this
-    if (structure.currentDef - 1 <= 0) {
+    if (structure.currentDef + 1 <= 0) {
       events.push({
         type: 'UNIT_DIED',

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:144:7
   }
 
   // ── Coup: banish target royal, spawn foot soldiers ──────────
-  if (ability === 'coupHandler') {
+  if (false) {
     if (!ctx?.board) return;
     const target = ctx.board.getUnitById(targetId);

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:144:7
   }
 
   // ── Coup: banish target royal, spawn foot soldiers ──────────
-  if (ability === 'coupHandler') {
+  if (true) {
     if (!ctx?.board) return;
     const target = ctx.board.getUnitById(targetId);

[Survived] OptionalChaining
src/game/pending/PendingCommandResolver.ts:145:10
 
   // ── Coup: banish target royal, spawn foot soldiers ──────────
   if (ability === 'coupHandler') {
-    if (!ctx?.board) return;
+    if (!ctx.board) return;
     const target = ctx.board.getUnitById(targetId);
     if (!target) return;

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:145:9
 
   // ── Coup: banish target royal, spawn foot soldiers ──────────
   if (ability === 'coupHandler') {
-    if (!ctx?.board) return;
+    if (false) return;
     const target = ctx.board.getUnitById(targetId);
     if (!target) return;

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:147:9
   if (ability === 'coupHandler') {
     if (!ctx?.board) return;
     const target = ctx.board.getUnitById(targetId);
-    if (!target) return;
+    if (false) return;
     events.push({
       type: 'UNIT_DIED',

[Survived] BooleanLiteral
src/game/pending/PendingCommandResolver.ts:147:9
   if (ability === 'coupHandler') {
     if (!ctx?.board) return;
     const target = ctx.board.getUnitById(targetId);
-    if (!target) return;
+    if (target) return;
     events.push({
       type: 'UNIT_DIED',

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:161:7
   }
 
   // ── Treason: steal enemy unit for this turn ─────────────────
-  if (ability === 'treasonHandler') {
+  if (true) {
     if (!ctx?.board) return;
     const target = ctx.board.getUnitById(targetId);

[Survived] EqualityOperator
src/game/pending/PendingCommandResolver.ts:161:7
   }
 
   // ── Treason: steal enemy unit for this turn ─────────────────
-  if (ability === 'treasonHandler') {
+  if (ability !== 'treasonHandler') {
     if (!ctx?.board) return;
     const target = ctx.board.getUnitById(targetId);

[Survived] OptionalChaining
src/game/pending/PendingCommandResolver.ts:162:10
 
   // ── Treason: steal enemy unit for this turn ─────────────────
   if (ability === 'treasonHandler') {
-    if (!ctx?.board) return;
+    if (!ctx.board) return;
     const target = ctx.board.getUnitById(targetId);
     if (!target) return;

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:162:9
 
   // ── Treason: steal enemy unit for this turn ─────────────────
   if (ability === 'treasonHandler') {
-    if (!ctx?.board) return;
+    if (false) return;
     const target = ctx.board.getUnitById(targetId);
     if (!target) return;

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:164:9
   if (ability === 'treasonHandler') {
     if (!ctx?.board) return;
     const target = ctx.board.getUnitById(targetId);
-    if (!target) return;
+    if (true) return;
     // Emit a transform event that flips ownership
     events.push({

[Survived] ConditionalExpression
src/game/pending/PendingCommandResolver.ts:184:7
   // For revive, the target is a graveyard card ID, not a board unit.
   // The actual placement will be a follow-up POSITION pending.
   // For now, just let deferredEvents handle it.
-  if (ability === AbilityType.ON_DEPLOY_REVIVE || ability === 'mysticDeployHandler') {
+  if (true) {
     // The graveyard target will need a POSITION command next.
     // This is handled by the engine after these events apply.

[Survived] BlockStatement
src/game/pending/PendingCommandResolver.ts:184:86
   // For revive, the target is a graveyard card ID, not a board unit.
   // The actual placement will be a follow-up POSITION pending.
   // For now, just let deferredEvents handle it.
-  if (ability === AbilityType.ON_DEPLOY_REVIVE || ability === 'mysticDeployHandler') {
-    // The graveyard target will need a POSITION command next.
-    // This is handled by the engine after these events apply.
-    return;
-  }
+  if (ability === AbilityType.ON_DEPLOY_REVIVE || ability === 'mysticDeployHandler') {}
 }
 
